# Задание №2 упражнение №1

side_a = int(input("Введите длину стороны квадрата: "))

area_1 = 4 * side_a;
area_2 = side_a * side_a;

print("Вывод: ")
print("Периметр квадрата: ", area_1)
print("Площадь квадрата: ", area_2)


# Задание №2 упражнение №2

side_b = int(input("Введите длину стороны прямоугольника: "))
side_c = int(input("Введите длину стороны прямоугольника: "))

area_3 = (side_b + side_c) * 2;
area_4 = side_b * side_c;

print("Вывод: ")
print("Периметр прямоугольника: ", area_3)
print("Площадь прямоугольника: ", area_4)